---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MechanicalSystem.IsPressureDropServerMissing
source: html/eaa803ff-9cc2-ce43-f48a-87c5f565e71e.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystem.IsPressureDropServerMissing Method

Indicates if any pressure drop server which was used in the mechanical system is not available.

## Syntax (C#)
```csharp
public bool IsPressureDropServerMissing()
```

## Returns
True if there is any pressure drop server not available, false otherwise.